fdr/src/test/resources/requests/nodoChiediNumeroAvviso.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.pagamenti.telematici.gov/" >
    <soap:Header/>
    <soap:Body>
        <ws:nodoChiediNumeroAvviso>
            <identificativoPSP>{psp}</identificativoPSP>
            <identificativoIntermediarioPSP>{brokerPsp}</identificativoIntermediarioPSP>
            <identificativoCanale>{channel}</identificativoCanale>
            <password>{channelPwd}</password>
            <idServizio>{idServizio}</idServizio>
            <idDominioErogatoreServizio>{pa}</idDominioErogatoreServizio>
            <datiSpecificiServizio>{datiSpecificiServizio}</datiSpecificiServizio>
        </ws:nodoChiediNumeroAvviso>
    </soap:Body>
</soap:Envelope>
